{
    "makeup": [
      {
        "id": 1,
        "name": "Airbrush Flawless Longwear Foundation by Charlotte Tilbury",
        "image": "https://ik.imagekit.io/vonlhgv94ld/charlotteair_Gb77Uz4o1.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298719981",
        "likes": 200,
        "category": "Face",
        "price": "$44",
        "description": "A full coverage, matte, liquid foundation. This hybrid skincare-foundation contains Charlotte Tilbury’s magic matrix of ingredients, including the groundbreaking Magic REPLEXIUM® to reduce the appearance of wrinkles. The hydrating, lightweight formula is sweat-proof, humidity-proof, waterproof, and transfer-resistant. For best results, start by applying Charlotte's Magic Cream (sold separately) to prime the skin.",
        "reviews":[
            {
                "id":1,
                "comment": "Love it!"
            }, 
            {
              "id":2,
              "comment": "Great foundation! Love how it feels on my skin."
            },
            {
              "id":3,
              "comment":"Looks cakey if you use too much, but if you don’t use too much it looks pretty good. Definitely full coverage!"
            }
        ]
      },
      {
        "id": 2,
        "name": "CC + Cream with SPF 50 + by IT Cosmetics",
        "image": "https://ik.imagekit.io/vonlhgv94ld/itcc_KYjtHi798.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298982258",
        "likes": 253,
        "category": "Face",
        "price": "$42",
        "description": "This bestselling, full-coverage, SPF 50 CC cream is an all-in-one foundation, brightening color corrector, hydrating serum, pore-less finish primer, dark spot concealer, and moisturizer. It’s offered in a range of shades that flatter multiple skin tones and deliver a natural finish.",
        "reviews":[
            {
                "id":1,
                "comment": "I love this formula and product. I have been using it for over 3 years now. It gives me a full coverage look without feeling heavy and the lasting power is amazing. Important not that even the fairest shade is very dark (in comparison to other brands colors)."
            }
        ]
      },
      {
        "id": 3,
        "name": "Radiant Creamy Concealer by NARS",
        "image": "https://ik.imagekit.io/vonlhgv94ld/narsconcealer__xkg83MvYyvT.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298982571",
        "likes": 200,
        "category": "Face",
        "price": "$30",
        "description": "A multipurpose concealer that brightens, corrects, and perfects for up to 16 hours with a creamy medium-to-buildable coverage and natural, radiant finish. It's enriched with hydrating, multiaction skincare benefits and light-diffusing technology, that instantly obscures imperfections and diminishes fine lines and signs of fatigue. This multipurpose concealer can also be used to highlight and contour. Available in 30 shades in both standard and mini sizes.",
        "reviews":[
            {
                "id":1,
                "comment": "This has been my favourite concealer for over a decade! It’s perfect coverage, my perfect shade and doesn’t pile or set in fine lines."
            },
            {
              "id":1,
              "comment": "Best concealer I’ve ever used!! Long wearing, doesn’t crease, does have any grey tint to it and long wearing! Doesn’t patch or look cakey either. 10/10!"
            }
        ]
      },
      {
        "id": 4,
        "name": "Positive Light Liquid Luminizer Highlight by Rare Beauty",
        "image": "https://ik.imagekit.io/vonlhgv94ld/highlighter_Ys3KhfJEE.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298982050",
        "likes": 150,
        "category": "Face",
        "price": "$22",
        "description": "A silky, second-skin liquid highlighter that creates a lasting, soft, and luminous finish.Packed with light-reflecting pearl particles and a botanical blend of lotus, gardenia, and white waterlily, this multidimensional formula lends skin a dewy glow in seconds. Mix this weightless liquid highlighter with foundation or layer it across the high points of the face for instant radiance.",
        "reviews":[
            {
                "id":1,
                "comment": "Amazing and natural shine. Stayed on all day even with a mask. Definitely will become a permanent part of my collection."
            }
        ]
      },
      {
        "id": 5,
        "name": "Lights, Camera, Lashes™ 4-in-1 Mascara",
        "image": "https://ik.imagekit.io/vonlhgv94ld/tartemascara_rSJAN4ilrV.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298983024",
        "likes": 25,
        "category": "Eye",
        "price": "$24",
        "description": "A vegan mascara that delivers a 35 percent increase in curl while also lengthening, volumizing, and conditioning lashes for 24-hr smudge-proof, flake-free wear. This multi-benefit mascara delivers darker, longer, thicker lashes to make your eyes appear bigger and brighter. It also conditions your lashes with olive esters, rice bran, and pro vitamin B5—it’s the ultimate lash nutrition.",
        "reviews":[
            {
                "id":1,
                "comment": "You better look for waterproof! If you have any oil production near your eyes, you will 100% end up with raccoon eyes (even with setting spray)"
            }
        ]
      },
      {
        "id": 6,
        "name": "Master Mattes™ Liquid Eyeliner by Makeup By Mario",
        "image": "https://ik.imagekit.io/vonlhgv94ld/marioliner_FevvWArP-.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298982129",
        "likes": 80,
        "category": "Eye",
        "price": "$22",
        "description": "A pro liquid liner formula that provides long-lasting, waterproof definition with an effortless flexible tip. This liquid liner is also extremely pigmented and features a super sharp, flexible felt tip for ultimate control.",
        "reviews":[
            {
                "id":1,
                "comment": "AMAZING. Stays on until you take it off. 10/10 would recommend."
            }
        ]
      },
      {
        "id": 7,
        "name": "Rouge Dior Forever Liquid Transfer-Proof Lipstick by Dior",
        "image": "https://ik.imagekit.io/vonlhgv94ld/diorlip_hMnGfEhKWj-.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298925648",
        "likes": 67,
        "category": "Lip",
        "price": "$38",
        "description": "A transfer-proof, matte liquid lip color that is ultra-pigmented with 12 hour weightless long-wear.",
        "reviews":[
            {
                "id":1,
                "comment": "I love this lipstick so much, gorgeous color and stays on so long! I love the packaging as well! The only thing is it is a little drying but it is worth it for no transfer/color pay off"
            }
        ]
      },
      {
        "id": 8,
        "name": "Gloss Bomb Universal Lip Luminizer by Fenty Beauty",
        "image": "https://ik.imagekit.io/vonlhgv94ld/fentylip_dzO3Qi9qx.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298982061",
        "likes": 98,
        "category": "Lip",
        "price": "$20",
        "description": "An ultimate, gotta-have-it lip gloss with explosive shine that feels as good as it looks. The non-sticky formula is super shiny, and has an addictive peach-vanilla scent you just can't get enough of.",
        "reviews":[
            {
                "id":1,
                "comment": "Such a good gloss. It is not sticky and gives a good amount of color."
            }
        ]
      },
      {
        "id": 9,
        "name": "Blush Trio by Anastasia Beverly Hills",
        "image": "https://ik.imagekit.io/vonlhgv94ld/blush_MXntsobLaA3.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298981868",
        "likes": 22,
        "category": "Cheek",
        "price": "$30",
        "description": "A trio of fully pigmented blushes for buildable intensity with a seamless finish. These finely-milled formulas offer seamless blending and full-pigments for buildable coverage.",
        "reviews":[
            {
                "id":1,
                "comment": "I love this blush trio!! The formula is very creamy, buildable, and blendable! The pigmentation is great and the colours really work well for me! I know I will get a beautiful result every time I use this palette! I would recommend!"
            }
        ]
      },
      {
        "id": 10,
        "name": "Hoola Bronzer by Benefit Cosmetics",
        "image": "https://ik.imagekit.io/vonlhgv94ld/hoola_FOb0LMYZbeF.png?ik-sdk-version=javascript-1.4.3&updatedAt=1643298982235",
        "likes": 160,
        "category": "Cheek",
        "price": "$30",
        "description": "An award-winning Hoola Bronzing powder for a sunkissed glow all year round. It comes complete with a built-in mirror and powder brush. These finely-milled bronzers blend smoothly and seamlessly.",
        "reviews":[
            {
                "id":1,
                "comment": "I love this bronzer and I found it really easy to use even as a beginner."
            }
        ]
      }
     
    ]
  }